[
    {
        "name": "Cascina Spinasse",
        "comment_user_name": "BlissfulSnaps",
        "comment_under": "Exquisite Italian cuisine that transports you to the heart of Italy with every bite."
    },
    {
        "name": "The Pink Door",
        "comment_user_name": "WanderlustDreamer",
        "comment_under": "A hidden gem with a charming ambiance and delectable Italian-American dishes that will leave you wanting more."
    },
    {
        "name": "Ba Bar",
        "comment_user_name": "DapperGlimpse",
        "comment_under": "A vibrant Vietnamese eatery offering a flavorful culinary journey through the streets of Vietnam."
    },
    {
        "name": "Shaker + Spear",
        "comment_user_name": "RadiantSmiles",
        "comment_under": "An upscale seafood destination serving fresh, succulent dishes paired with impeccable service."
    },
    {
        "name": "Biang Biang Noodles",
        "comment_user_name": "CreativeWhiz",
        "comment_under": "Authentic Chinese noodles that are wide, chewy, and bursting with bold flavors—truly a noodle lover's paradise."
    },
    {
        "name": "Spice Waala",
        "comment_user_name": "SereneSoul",
        "comment_under": "A delightful Indian street food spot where you can savor the aromatic spices and vibrant flavors of India."
    },
    {
        "name": "Marination Ma Kai",
        "comment_user_name": "ArtisticVisionary",
        "comment_under": "A fusion of Hawaiian and Korean flavors come together in a picturesque waterfront setting, perfect for a relaxing meal."
    },
    {
        "name": "Katsu-ya Seattle",
        "comment_user_name": "CaptivatingEyes",
        "comment_under": "A haven for sushi enthusiasts, offering a wide array of beautifully crafted sushi and sashimi delights."
    },
    {
        "name": "Kizuki Ramen & Izakaya",
        "comment_user_name": "WildHearted",
        "comment_under": "Slurp-worthy bowls of soul-warming ramen that will transport you straight to the bustling streets of Tokyo."
    },
    {
        "name": "Tacos Chukis",
        "comment_user_name": "InstaExplorer",
        "comment_under": "Authentic Mexican street tacos bursting with fresh ingredients and bold flavors that will satisfy your taco cravings."
    },
    {
        "name": "Mr. West Cafe Bar",
        "comment_user_name": "ChicAdventurer",
        "comment_under": "A trendy and inviting cafe bar serving artisanal coffee, delectable brunch dishes, and a cozy atmosphere."
    },
    {
        "name": "Cafe Flora",
        "comment_user_name": "GracefulPoses",
        "comment_under": "A haven for plant-based food lovers, offering creative and delicious vegetarian and vegan dishes in a charming garden setting."
    },
    {
        "name": "Zig Zag Cafe",
        "comment_user_name": "MysticWanderer",
        "comment_under": "A cozy neighborhood spot with a cool vibe and fantastic cocktails."
    },
    {
        "name": "Pomodoro",
        "comment_user_name": "VibrantVibes",
        "comment_under": "Authentic Italian flavors served in a warm and inviting atmosphere."
    },
    {
        "name": "Meet Korean BBQ",
        "comment_user_name": "HappyGoLucky",
        "comment_under": "A fun and interactive dining experience where you can grill your own delicious Korean BBQ."
    },
    {
        "name": "Piroshky Piroshky",
        "comment_user_name": "DreamyEscapes",
        "comment_under": "Mouthwatering Russian pastries that are flaky, savory, and oh-so-delicious."
    },
    {
        "name": "Biscuit Bitch",
        "comment_user_name": "WhimsicalSerenity",
        "comment_under": "A quirky and lively breakfast spot known for its indulgent biscuits and creative twists on classic dishes."
    },
    {
        "name": "AQUA by El Gaucho",
        "comment_user_name": "UrbanAdventures",
        "comment_under": "A sophisticated waterfront steakhouse offering impeccable service and a delectable menu."
    },
    {
        "name": "Daniel’s Broiler",
        "comment_user_name": "FlawlessFrames",
        "comment_under": "A classic steakhouse with an elegant ambiance and top-notch steaks cooked to perfection."
    },
    {
        "name": "Sisters And Brothers",
        "comment_user_name": "Sun-KissedSoul",
        "comment_under": "A laid-back Southern fried chicken joint serving up crispy, juicy goodness that will leave you craving more."
    },
    {
        "name": "Dead Line",
        "comment_user_name": "BoldExpressions",
        "comment_under": "A trendy speakeasy-style bar with a unique cocktail menu and a cool, underground vibe."
    },
    {
        "name": "Eden Hill Restaurant",
        "comment_user_name": "MidnightStrolls",
        "comment_under": "A fine dining experience where innovative dishes and beautiful presentations take center stage."
    },
    {
        "name": "19 GOLD",
        "comment_user_name": "EnchantingClicks",
        "comment_under": "A hip and trendy bar featuring craft cocktails and a lively atmosphere."
    },
    {
        "name": "Xi’an Noodles",
        "comment_user_name": "PoeticJourney",
        "comment_under": "A hidden gem serving up authentic and flavorful Xi'an noodles that will satisfy your noodle cravings."
    },
    {
        "name": "Morfire",
        "comment_user_name": "FreeSpirit",
        "comment_under": "A vibrant and fiery Thai restaurant known for its bold flavors and spicy dishes."
    }
]