[
    {
        "name": "Scholarships and Funding for the 2024-25 Academic Year",
        "descr": "Greetings iSchoolers!\n\nThis message is resources for scholarship funding opportunities for the 2024-25 academic year. Please review the information and identify which resources best fit your needs.\n\nFAFSA/WASFA: if you are relying on federal aid, grants, or loans, you need to complete the FAFSA or WASFA. The UW priority date for submitting these forms is FEBRUARY 28. You can submit the form after that date, but your aid package will be delayed.\n\niSchool Scholarships: the iSchool has several endowed, term and gift fund scholarship we award to continuing students. All MSIM, MLIS and INFO students who will enroll for the 2024-25 academic year, are eligible to apply. Scholarships will be awarded starting in Autumn 2024.\n\nExternal Scholarships: to optimize your search for scholarship funding, please review the following resources. Many external scholarships will have deadlines in the next few months and now is a good time to review these opportunities.\nResources linked on iSchool website: INFO/MLIS/MSIM\nGraduate Funding Information Service (GFIS):\nOffice of Merit Scholarships, Fellowships & Awards\n\nPlease let me know if you have any questions.\n\nWendie Phillips\nDirector for Student Services\nMary Gates Hall Suite 420\nSeattle, WA 98195\n206.543.3172 / cell 206.550.3771\nwrp@uw.edu / ischool.uw.edu",
        "publish_time": "2 hours ago",
        "category": "Scholarships",
        "num_cares": 473,
        "Picture_link": "/img/img1.jpg",
        "user_name": "Wendie Phillips, Director for Student Services",
        "user_image": "/img/user_image1.jpg"
    },
    {
        "name": "Coloring & Coffee- IUGA Diversity Committee",
        "descr": "The Informatics Undergraduate Association's first diversity committee presents an evening of coloring and some cozy hot cups of coffee, tea, hot chocolate and other snacks! Come chill and destress with us before finals!\nEvent detail: Thursday, February 22, 2024 | 5:30-6:30PM | HUB 250\nRSVP Form: https://forms.gle/K19XznL2HEHYsVer9",
        "publish_time": "48 minutes ago",
        "category": "Student Organization, Diversity",
        "num_cares": 76,
        "Picture_link": "/img/img2.jpg",
        "user_name": "Informatics Undergraduate Association",
        "user_image": "/img/user_image2.jpg"
    },
    {
        "name": "BECU Panel Discussion: Meet & Greet with industry leaders",
        "descr": "Sign up here to connect with BECU leaders!",
        "publish_time": "4 days ago",
        "category": "Industry, Career Opportunities, Panel Talk",
        "num_cares": 216,
        "Picture_link": "/img/img3.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image3.jpg"
    },
    {
        "name": "WINFO Elections Application Due Soon!!",
        "descr": "Hello INFO Majors!!\n\nAre you or someone you know interested in running for a WINFO officer position? WINFO elections are currently underway! Head over to the official WINFO elections page (@winfoelections) for more information and to learn about our officers! Please note that only INFO majors with at least one year left at UW are eligible to run for a position.\n\nCheck out our Instagram post for details about each step of our elections timeline, and be sure to mark these dates:\n\nMon 2/5 - Sun 2/11: Learn about our officer roles\nFri 2/16: Attend Officer Office Hours to learn more about an officer’s role\nMon 2/19 at 11:59 PM: Application to run for elections closes!\nMon 2/19 - Fri 2/23: Prepare campaign materials\nMon 2/26 - Fri 3/1: Start posting campaigns on the elections page!\nMon 3/4 - Wed 3/6: VOTE!\nFri 3/8: Results announced!\n\nIf you're unsure about running and you want to learn more about the officer roles, come to our Officer Office Hours TOMORROW from 5:30 to 7:00pm! Zoom link: https://washington.zoom.us/s/7031801402\n\nFill out the application by Monday 2/19 at 11:59 pm! https://forms.gle/WnENDqGyGMWFSxVL7\n\nIf you have any questions about any roles, feel free to message any of us or visit WINFO’s instagram page (@uwwinfo)\n\nBest of luck to everyone running!\n\nUW Women in Informatics (WINFO)\n\nwinfo@uw.edu\nwinfo.ischool.uw.edu",
        "publish_time": "5 days ago",
        "category": "Student Organization, Election",
        "num_cares": 59,
        "Picture_link": "/img/img3.jpg",
        "user_name": "UW Women in Informatics (WINFO)",
        "user_image": "/img/user_image4.jpg"
    }, 
    {
        "name": "Sign up Now, iAffiliates Boeing Panel Discussion",
        "descr": "iAffiliates is excited to offer a unique opportunity for iSchool students to meet and talk with Boeing leaders, exploring diverse engineering and technology career paths that can shape your future.",
        "publish_time": "1 days ago",
        "category": "Career Opportunities, Panel Talk",
        "num_cares": 107,
        "Picture_link": "/img/img4.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image5.jpg"
    }, 
    {
        "name": "Women in Entrepreneurship Panel",
        "descr": "Wednesday, February 21, 2024 | 4 - 6 PM\nStartup Hall, UW Campus\n\nThe iSchool prepares information leaders to research information challenges and design solutions that improve people's lives and make information work. It's no surprise that graduates of the iSchool go on to lead and innovate from within companies as intrapreneurs. More and more, graduates of the iSchool are taking their creative solutions forward by founding companies and developing products as entrepreneurs whose technical and data skills become the perfect foundation for launching a business venture.\n\nWhether you’re already working on a startup, want to know more about entrepreneurship, or are curious about the process of launching your own company, join WE Lead for a panel featuring entrepreneurial graduates of the iSchool. The featured alumnae speakers are using their iSchool degrees in entrepreneurial ways inside companies, and within their own ventures, and will share highlights and challenges from their own career journeys.\n\nAmple snacks and beverages will be provided — be sure to register so we can plan accordingly, and to receive event updates.\n\nPanelists:\n\nIshita Bhandari, '20 (MSIM) | Founder, Watto AI\nAshley Farley, '17 (MLIS) | Program Officer of Knowledge & Resource Services, Bill & Melinda Gates Foundation\nSophin Liu, '20 (MSIM) | Commercial Analytics Manager, Acadia Pharmaceuticals\nRaiham Malik, '22 (Informatics) | Founder & Developer, mAlIk Software\nModerator: Sara Sanford | Assistant Professor, University of Washington iSchool | Founder & Principal Consultant, GEN Certification\n\nCost: Free\nContact: ialumni@uw.edu",
        "publish_time": "11 days ago",
        "category": "Entrepreneurship, Women in Technology, Panel Talk",
        "num_cares": 87,
        "Picture_link": "/img/img5.jpg",
        "user_name": "Informatics Alumni",
        "user_image": "/img/user_image6.jpg"
    }, {
        "name": "RAISE Seminar: Danish Pruthi",
        "descr": "Abstract: While large deep learning models have become increasingly accurate, concerns about their (lack of) interpretability have taken a center stage. In response, a growing subfield on interpretability and analysis of these models has emerged. While hundreds of techniques have been proposed to “explain” predictions of models, what aims these explanations serve and how they ought to be evaluated are often unstated. In this talk, I will first present a framework to quantify the value of explanations, which allows us to compare different explanation techniques. Further, I will highlight the need for holistic evaluation of models, sharing two tales on (i) how geographically representative are artifacts produced from text-to-image generation models, and (ii) how well can conversational LLMs challenge false assumptions?\n\nBio: Danish Pruthi is an Assistant Professor at the Indian Institute of Science (IISc), Bangalore. He received his Ph.D. from the School of Computer Science at Carnegie Mellon University. He is broadly interested in the areas of natural language processing and deep learning, with a focus towards inclusive development and evaluation of AI models. He completed his bachelor's degree in computer science from BITS Pilani, Pilani. He is also a recipient of the Schmidt Sciences AI2050 Early Career Fellowship, Siebel Scholarship, CMU Presidential Fellowship and industry awards from Google and Adobe Inc. Until recently, his legal name was only Danish—an “edge case” for many deployed NLP systems, leading to airport quagmires and, in equal parts, funny anecdotes.",
        "publish_time": "20 days ago",
        "category": "Lecture, Research, Data Science",
        "num_cares": 271,
        "Picture_link": "/img/img6.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image6.jpg"
    }, 
    {
        "name": "Alaska Air Student Environmental Innovation Challenge",
        "descr": "Apply now for the Alaska Airlines Environmental Innovation Challenge (EIC) hosted by the University of Washington’s Buerk Center for Entrepreneurship.\n\nOpen to all undergraduate and graduate students at colleges and universities in WA, OR, ID, AK, and British Columbia.\n\nBring your skills or innovative ideas to create change in the environmental space! Open to all students attending an accredited college/university in WA, OR, ID, AK, and British Columbia.\n\nThe Alaska Airlines Environmental Innovation Challenge (EIC) is UW’s annual student-led environmental startup competition hosted by the Buerk Center for Entrepreneurship. This exciting, hands-on experience for both undergraduate and graduate students is the place to bring your idea to life (think cleantech, circular economy, climate tech, clean energy, ocean health, SDGs, regenerative ag, and more!) with the help of local entrepreneurs and industry experts. Students who enter will receive judges’ feedback on their ideas, networking opportunities, and the potential to win prize money. Enter the EIC with any product, process, non-profit, or service idea that addresses an environmental problem.\n\nLearn more. Full details on the EIC website.\nApplication Office Hours February 8, February 9.\nApply! Submit your application by February 12 @ 12 noon PT.\nQuestions? E-mail EIC manager Lauren Brohawn at brohal@uw.edu.\n\nDid you say prizes?!\nIn addition to the chance of winning 3rd, 2nd, or the $15,000 grand prize, finalist teams could win one of these:\n\nBig Picture Prize ($5,000)\nClean Energy Prize sponsored by the UW Clean Energy Institute\nRewards student innovations that can reduce carbon emissions through solar energy production, electrical energy storage, conversion and distribution, and energy efficiency. This can include software and/or hardware.\n\nBest Idea Prizes ($2,500)\nClimate Impact Prize sponsored by Eric Carlson, Board Member of E8 Angels\nRecognizes a team that has thoughtfully incorporated and quantified carbon footprint into the development and communication of their innovation.\n\nLeo Cup Innovation in Oceanography Prize sponsored by the Leo Maddox Family and UW’s School of Oceanography\nRecognizes students for creating innovative solutions to address issues of ocean health, with a preference for addressing marine pollution, including ocean plastics or other pollutants.\n\nLauren Brohawn | Associate Director\nShe/Her/Hers\nAlaska Airlines Environmental Innovation Challenge\nUniversity of Washington | Buerk Center for Entrepreneurship\nbrohal@uw.edu | startup.uw.edu",
        "publish_time": "20 days ago",
        "category": "Competition, Entrepreneurship",
        "num_cares": 214,
        "Picture_link": "/img/img7.jpg",
        "user_name": "Lauren Brohawn, Associate Director",
        "user_image": "/img/user_image7.jpg"
    }, 
    {
        "name": "IUGA Web Development Internship Opportunity",
        "descr": "Hey iSchoolers,\n\nReminder that applications for IUGA's Web Development Internship are open for all current and prospective Informatics majors, regardless of experience level! Join IUGA's Creative Director, Sheamin Kim, and Director of IT, Eric Kim, in transforming the current, static IUGA website into a dynamic platform, where you will learn valuable HTML, JavaScript and React skills as well as UI/UX skills through Figma in the process. A more improved website will facilitate engagement between the Informatics student body and IUGA, as well as improve communication within the iSchool as a whole; as an intern, you can benefit from playing a role on a project with an impact in the real world. With a commitment of up to 5 hours a week, you can be assured that this role is relatively low commitment, with a very high reward.\n\nIf you are interested in this position and would like to expand your digital portfolio and presence, please apply here before application close Monday, November 6. Help us help you!\n\nRegards,\nIUGA Board 2023 - 2024\n\nInformatics Undergraduate Association",
        "publish_time": "25 days ago",
        "category": "Career Opportunities, Student Organization, UIUX, Software Development",
        "num_cares": 49,
        "Picture_link": "/img/img8.jpg",
        "user_name": "Informatics Undergraduate Association",
        "user_image": "/img/user_image8.jpg"
    },
    {
        "name": "iMentorship Applications opening on January 3",
        "descr": "Good afternoon all,\n\nAs you wrap-up Autumn quarter, I wanted to put something on your radar.\n\nAs you look towards your professional future, would it be valuable to have someone who can guide you, act as a sounding board, provide support, and assist you in expanding your professional network? That’s where a mentor can help. As a participating student you will be individually paired with an information professional who has volunteered to be your mentor and support you in making the transition from student to working professional.\n\nWe will have ~150 spots designated for Informatics students. We will first invite those who will be graduating this academic year. If we still have mentors available, we will invite all other interested Informatics students to participate.\n\nThe initial invitation with program details and a link to the sign-up forms will be emailed on Wednesday January 3rd. Please be on the lookout for that email, if you’d like to get a spot in the program this year.\n\nThe program will run from January through May, although we hope you and your mentor will continue to work together well into the future!\n\nBest of luck with finals!\n\nLaura Schildkraut\n\niMentorship Director",
        "publish_time": "1 month ago",
        "category": "Mentorship, Industry",
        "num_cares": 393,
        "Picture_link": "/img/img9.jpg",
        "user_name": "Laura Schildkraut, iMentorship Director",
        "user_image": "/img/user_image9.jpg"
    }, 
    {
        "name": "Online info video for the iSchool Portugal program",
        "descr": "Hi all,\n\nIf you’re interested in learning more about the inaugural iSchool Portugal study abroad program (iSchool Portugal: Innovation, Democracy, and Cultural Heritage in Portugal), you’re in luck: I’ve uploaded an info video for it that you can watch on YouTube at https://youtu.be/gGuxGFjNf_E. You can apply for the program via the program’s information page at https://studyabroad.washington.edu/index.cfm?FuseAction=Programs.ViewProgramAngular&id=12328. The application deadline for priority consideration (including scholarships) is February 15. If you have any questions, don’t hesitate to send ‘em along!\n\nThanks and take care,\n\nTrent\n-- \n\nTrent Hill, PhD, MLIS (he / him)\n\nAssociate Teaching Professor\n\nThe Information School\n\nUniversity of Washington",
        "publish_time": "20 days ago",
        "category": "Study Abroad",
        "num_cares": 47,
        "Picture_link": "/img/img10.jpg",
        "user_name": "Trent Hill, Associate Teaching Professor",
        "user_image": "/img/user_image10.jpg"
    },
    {
        "name": "Ed Mignon Distinguished Lecture with Dr.Wendy Chun",
        "descr": "Join us for the Ed Mignon Distinguished Lecture with Wendy Hui Kyong Chun, Simon Fraser University’s Canada 150 Research Chair in New Media, Professor in the School of Communication, and Director of the Digital Democracies Institute. At the Institute, she leads the Mellon-funded Data Fluencies Project, which combines the interpretative traditions of the arts and humanities with critical work in the data sciences to express, imagine, and create innovative engagements with (and resistances to) our data-filled world. She has studied both Systems Design Engineering and English Literature, which she combines and mutates in her research on digital media. She has authored many books, including: Control and Freedom: Power and Paranoia in the Age of Fiber Optics (MIT, 2006), Programmed Visions: Software and Memory (MIT 2011), Updating to Remain the Same: Habitual New Media (MIT 2016), and Discriminating Data: Correlation, Neighborhoods, and the New Politics of Recognition (2021, MIT Press). She has been Professor and Chair of the Department of Modern Culture and Media at Brown University, where she worked for almost two decades and is currently a Visiting Professor. She is a Fellow of the Royal Society of Canada, and has also held fellowships from: the Guggenheim, ACLS, American Academy of Berlin, Radcliffe Institute for Advanced Study at Harvard. The Ed Mignon Distinguished Lectureship is named after UW Information School alumnus and former faculty member Dr. Edmond Mignon. It is made possible by a gift from his wife, Molly Mignon.",
        "publish_time": "25 days ago",
        "category": "Lecture, Panel Talk",
        "num_cares": 128,
        "Picture_link": "/img/img11.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image6.jpg"
      },
      {
        "name": "iStartup Lab",
        "descr": "Learn how to find funding for your student startup in this online panel discussion from the iStartup Lab. How to turn your class project or hackathon concept into a startup on Friday, January 19, 2024, 12:00-1:00 pm pacific time in an In-person workshop at UW Seattle campus, and how to find funding for your student startup on Friday, March 8, 2024, 12:00-1:00 pm pacific time in a Panel discussion on Zoom. To register for our events, please fill out the RSVP form.",
        "publish_time": "15 days ago",
        "category": "Career Opportunity, Industry",
        "num_cares": 93,
        "Picture_link": "/img/img12.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image6.jpg"
      },
      {
        "name": "Out at Work: Navigating Authenticity in Professional Spaces",
        "descr": "Join iQueeries, the Informatics Undergraduate Association (IUGA), and the Office of IDEAS for 'Out at Work: Navigating Authenticity in Professional Spaces,' a panel discussion featuring inspiring individuals sharing their experiences as openly queer professionals. Explore personal narratives, inclusivity in the workplace, and the intersectionality of queer identities. Learn about support networks, allyship, and the journey to create more inclusive work environments. Open to all, this event offers a chance for meaningful dialogue, connection, and empowerment. Admission is free and food and refreshments will be provided! RSVP LINK: https://forms.gle/EAzoxAKYVJsCXWze7",
        "publish_time": "5 days ago",
        "category": "Student Organization, Panel Talk, Diversity",
        "num_cares": 57,
        "Picture_link": "/img/img13.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image6.jpg"
      },
      {
        "name": "WINFO HCI, Design + Accessibility in Tech Panel",
        "descr": "Interested in Human Computer Interaction (HCI)? Want to learn more about accessibility in HCI? Join WINFO’s Diversity Committee for a panel discussion of HCI Researchers! Come to learn about past projects and research they’ve worked on and enjoy yummy snacks! DATE: Thursday, Feb 1st TIME: 3:30-4:45 PM WHERE: HUB 334",
        "publish_time": "8 days ago",
        "category": "Student Organization, Panel Talk, Research",
        "num_cares": 93,
        "Picture_link": "/img/img14.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image6.jpg"
      },
      {
        "name": "[IUGA MERCH] MERCH SALE!!",
        "descr": "Hey iSchoolers! Did you miss last quarter’s merch drop and wish you had ordered an awesome quarter zip or fun hoodie? Want to help IUGA fund cooler and bigger events? Well fear not! We are holding an in-person MERCH SALE next week! When: 1/23 (Tuesday) from 2-4:30PM (stop by at any time!) Where: iLounge (4th Floor Mary Gates Hall) What to bring: Husky Card, payment method Payments accepted: Credit Card, Venmo, Paypal, Cash The designs and prices are in this document. Currently we still have items in all designs and sizes, but they will go quick! If you plan on attending, we encourage you fill out the (optional) RSVP form- depending on stock, we will try and hold some items for RSVP’d members (but no guarantees so we recommend you swing by early!) All profits will go to funding IUGA events and projects- meaning it goes back to you! If you have any questions, please email Sheamin at sheakim2@uw.edu. We can’t wait to see everyone decked out in swag! Best, IUGA Board 2023 - 2024 Informatics Undergraduate Association",
        "publish_time": "22 days ago",
        "category": "Student Organization",
        "num_cares": 49,
        "Picture_link": "/img/img15.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image6.jpg"
      }
]
