[
    {
        "name": "Scholarships and Funding for the 2024-25 Academic Year",
        "descr": "Greetings iSchoolers! This message is resources for scholarship funding opportunities for the 2024-25 academic year. Please review the information and identify which resources best fit your needs. FAFSA/WASFA: if you are relying on federal aid, grants, or loans, you need to complete the FAFSA or WASFA. The UW priority date for submitting these forms is FEBRUARY 28. You can submit the form after that date, but your aid package will be delayed. As you may be aware, the US Government updated the FAFSA process this year and it has been a bit bumpy. UW Financial Aid has indicated that the form is running smoothly now with only a few hiccups. However, the reporting timeline from US Government to the universities will be delayed, which means announcements on funding will be sent to students later than normal. New Admits will likely receive information in late April, while continuing students will receive information approximately a month later. There is additional information available on the https://www.washington.edu/financialaid/. All questions about FAFSA and WASFA should be directed to osfa@uw.edu\n\niSchool Scholarships: the iSchool has several endowed, term and gift fund scholarship we award to continuing students. All MSIM, MLIS and INFO students who will enroll for the 2024-25 academic year, are eligible to apply. Scholarships will be awarded starting in Autumn 2024.\n\nPlease note: Due to the delay in FAFSA reporting to the University of Washington, the iSchool is delaying their scholarship application process. Normally our scholarship applications are available in winter quarter. We are delaying the process until spring quarter (April). Please watch your email for an announcement when these applications will open to iSchool students as the application period will be open for only 2 weeks.\n\nExternal Scholarships: to optimize your search for scholarship funding, please review the following resources. Many external scholarships will have deadlines in the next few months and now is a good time to review these opportunities. Resources linked on iSchool website: INFO/MLIS/MSIM Graduate Funding Information Service (GFIS): Office of Merit Scholarships, Fellowships & Awards\n\nPlease let me know if you have any questions.",
        "publish_time": "2 hours ago",
        "category": "Scholarships",
        "num_cares": 473,
        "Picture_link": "/img/img1.jpg",
        "user_name": "Wendie Phillips, Director for Student Services",
        "user_image": "/img/user_image1.jpg"
    },
    {
        "name": "Coloring & Coffee- IUGA Diversity Committee",
        "descr": "The Informatics Undergraduate Association's first diversity committee presents an evening of coloring and some cozy hot cups of coffee, tea, hot chocolate and other snacks! Come chill and destress with us before finals!\nEvent detail: Thursday, February 22, 2024 | 5:30-6:30PM | HUB 250\nRSVP Form: https://forms.gle/K19XznL2HEHYsVer9",
        "publish_time": "48 minutes ago",
        "category": "Student Organization, Diversity",
        "num_cares": 76,
        "Picture_link": "/img/img2.jpg",
        "user_name": "Informatics Undergraduate Association",
        "user_image": "/img/user_image2.jpg"
    },
    {
        "name": "BECU Panel Discussion: Meet & Greet with industry leaders, Friday 2/16 11:30-12:30 via Zoom",
        "descr": "Sign up here to connect with BECU leaders!",
        "publish_time": "4 days ago",
        "category": "Industry, Career Opportunities, Panel Talk",
        "num_cares": 216,
        "Picture_link": "/img/img3.jpg",
        "user_name": "Informatics Program Coordinator",
        "user_image": "/img/user_image3.jpg"
    },
    {
        "name": "WINFO Elections Application Due Soon!!",
        "descr": "Hello INFO Majors!!\n\nAre you or someone you know interested in running for a WINFO officer position? WINFO elections are currently underway! Head over to the official WINFO elections page (@winfoelections) for more information and to learn about our officers! Please note that only INFO majors with at least one year left at UW are eligible to run for a position.\n\nCheck out our Instagram post for details about each step of our elections timeline, and be sure to mark these dates:\n\nMon 2/5 - Sun 2/11: Learn about our officer roles\nFri 2/16: Attend Officer Office Hours to learn more about an officer’s role\nMon 2/19 at 11:59 PM: Application to run for elections closes!\nMon 2/19 - Fri 2/23: Prepare campaign materials\nMon 2/26 - Fri 3/1: Start posting campaigns on the elections page!\nMon 3/4 - Wed 3/6: VOTE!\nFri 3/8: Results announced!\n\nIf you're unsure about running and you want to learn more about the officer roles, come to our Officer Office Hours TOMORROW from 5:30 to 7:00pm! Zoom link: https://washington.zoom.us/s/7031801402\n\nFill out the application by Monday 2/19 at 11:59 pm! https://forms.gle/WnENDqGyGMWFSxVL7\n\nIf you have any questions about any roles, feel free to message any of us or visit WINFO’s instagram page (@uwwinfo)\n\nBest of luck to everyone running!\n\nUW Women in Informatics (WINFO)\n\nwinfo@uw.edu\nwinfo.ischool.uw.edu",
        "publish_time": "5 days ago",
        "category": "Student Organization, Election",
        "num_cares": 59,
        "Picture_link": "/img/img3.jpg",
        "user_name": "UW Women in Informatics (WINFO)",
        "user_image": "/img/user_image4.jpg"
    }
]